In [56]:
import boto3
import pandas as pd

from datetime import datetime

import warnings
warnings.filterwarnings("ignore")

## Ingesting file from AWS S3

In [57]:
session = boto3.Session(
                    aws_access_key_id='AKIAQZSOZTNG557YER57',
                    aws_secret_access_key='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')
                    
s3       = session.resource('s3')
bucket   = s3.Bucket('mcsp-hiring-external')

obj      = bucket.Object(key='test_input_file.csv') 
response = obj.get()
lines    = response['Body'].read()

with open('file.csv', 'wb') as file:
    file.write(lines)

obj      = bucket.Object(key='install_logs.csv') 
response = obj.get()
lines    = response['Body'].read()

with open('install_logs.csv', 'wb') as file:
    file.write(lines)

obj      = bucket.Object(key='fraud_logs.csv') # mentioned as fraud_installs.csv in the 
                                               # question which is wrong
response = obj.get()
lines    = response['Body'].read()

with open('fraud_installs.csv', 'wb') as file:
    file.write(lines)

In [58]:
data = pd.read_csv('/Users/hduser/Desktop/file.csv') # Hardcode local path
data

,id,name,date_of_birth,Gender,device_type_us_state
0,0039c5a9-505a-4ece-80ac-6ee9225f0d2a,Liam,16/07/1978,NaN,android_CT-Connecticut
1,004d3491-8ff2-469e-8946-6fcf2e311329,Noah,04/03/2004,Female,iphone_DE-Delaware
2,00a9842b-7d31-45a1-b295-99d278588e40,William,10/09/1979,NaN,iphone_RI-Rhode Island
3,010acae5-8749-4cac-b5a9-ae83825b57b1,James,06/03/2012,F,iphone_PA-Pennsylvania
4,013a1028-4fd5-413a-b703-56fc15b773be,Oliver,23/06/1985,,android_CT-Connecticut
...,...,...,...,...,...
495,5940e528-0a15-4924-80d8-d45e7ac3ac0d,Tate,1998-09-25,,iphone_PA-Pennsylvania
496,594938a5-af20-4223-9b0b-3ae049eb9fc3,Frederick,1978-05-16,NaN,iphone_NY-New York
497,59689cfb-27d9-4e95-81fd-c79511947df5,Kieran,2003-10-05,Female,android_CT-Connecticut
498,596ff46b-3f1b-4402-b397-1641739165d3,Lawrence,1992-09-18,NaN,iphone_VT-Vermont
499,59a19d68-282a-4f27-ae03-016888016bbe,Moses,2003-10-05,FEMALE,iphone_DE-Delaware

In [59]:
data.drop(["id"], axis=1, inplace = True)

In [60]:
data

           name date_of_birth          Gender    device_type_us_state
0         Liam     16/07/1978             NaN  android_CT-Connecticut
1         Noah     04/03/2004          Female      iphone_DE-Delaware
2      William     10/09/1979             NaN  iphone_RI-Rhode Island
3        James     06/03/2012               F  iphone_PA-Pennsylvania
4       Oliver     23/06/1985                  android_CT-Connecticut
..          ...           ...             ...                     ...
495       Tate     1998-09-25                  iphone_PA-Pennsylvania
496  Frederick     1978-05-16             NaN      iphone_NY-New York
497     Kieran     2003-10-05          Female  android_CT-Connecticut
498   Lawrence     1992-09-18             NaN       iphone_VT-Vermont
499      Moses     2003-10-05          FEMALE      iphone_DE-Delaware

[500 rows x 4 columns]

## Extracting device_type and state

In [61]:
def extract_device_type(inp):
    device_type = inp.split("_")
    device_type = device_type[0].split()[0]
    return device_type

def extract_state(inp):
    state = inp.split("-")
    state = state[0].split()[0]
    state = state.split("_")
    state = state[1]
    return state

In [62]:
data["device_type"] = data.device_type_us_state.apply(extract_device_type)
data["state"]       = data.device_type_us_state.apply(extract_state)

data.drop(["device_type_us_state"], axis=1, inplace=True)

In [63]:
data

           name date_of_birth          Gender device_type state
0         Liam     16/07/1978             NaN     android    CT
1         Noah     04/03/2004          Female      iphone    DE
2      William     10/09/1979             NaN      iphone    RI
3        James     06/03/2012               F      iphone    PA
4       Oliver     23/06/1985                     android    CT
..          ...           ...             ...         ...   ...
495       Tate     1998-09-25                      iphone    PA
496  Frederick     1978-05-16             NaN      iphone    NY
497     Kieran     2003-10-05          Female     android    CT
498   Lawrence     1992-09-18             NaN      iphone    VT
499      Moses     2003-10-05          FEMALE      iphone    DE

[500 rows x 5 columns]

## Get Age

In [64]:
data.dtypes

name             object
date_of_birth    object
Gender           object
device_type      object
state            object
dtype: object

In [65]:
data['date_of_birth'] = pd.to_datetime(data['date_of_birth'])
data.dtypes

name                     object
date_of_birth    datetime64[ns]
Gender                   object
device_type              object
state                    object
dtype: object

In [66]:
def get_age():
    now = datetime.now()
    return (now.year - data['date_of_birth'].dt.year) - ((now.month - data['date_of_birth'].dt.month) < 0)

data['age'] = get_age()

data.drop(["date_of_birth"], axis= 1, inplace= True)

In [67]:
data

           name          Gender device_type state  age
0         Liam              NaN     android    CT   42
1         Noah           Female      iphone    DE   16
2      William              NaN      iphone    RI   41
3        James                F      iphone    PA    8
4       Oliver                      android    CT   35
..          ...             ...         ...   ...  ...
495       Tate                       iphone    PA   22
496  Frederick              NaN      iphone    NY   42
497     Kieran           Female     android    CT   17
498   Lawrence              NaN      iphone    VT   28
499      Moses           FEMALE      iphone    DE   17

[500 rows x 5 columns]

## Fill null values in Gender

In [68]:
data.Gender[(data.Gender == "Female") | (data.Gender == "FEMALE")] = "F"
data.Gender[(data.Gender == "Male")   | (data.Gender == "MALE")]   = "M"

In [69]:
data.Gender.value_counts()

M                 174
F                 164
                   49
Name: Gender, dtype: int64

In [70]:
data.isnull().sum()

name             1
Gender         113
device_type      0
state            0
age              0
dtype: int64

In [71]:
data.Gender.fillna ("M",      inplace= True)
data.Gender.replace(" ", "M", inplace= True)
data.drop(["name"], axis=1,   inplace= True)

In [72]:
data

             Gender device_type state  age
0                 M     android    CT   42
1                 F      iphone    DE   16
2                 M      iphone    RI   41
3                 F      iphone    PA    8
4                       android    CT   35
..              ...         ...   ...  ...
495                      iphone    PA   22
496               M      iphone    NY   42
497               F     android    CT   17
498               M      iphone    VT   28
499               F      iphone    DE   17

[500 rows x 4 columns]

## Number of devices for each Age

In [73]:
# Assumption:
# Number of devices for each Age is the count of 'phone_type' for each 'age' value

data.age.value_counts()

17    19
24    17
43    15
42    15
27    15
18    14
41    14
23    14
8     13
48    13
4     13
29    13
13    12
12    12
25    12
50    12
35    12
44    12
37    11
46    11
16    11
10    11
38    11
32    11
9     11
6     10
30    10
39    10
22    10
31    10
14    10
28     9
45     9
5      8
26     8
19     8
20     8
49     8
34     8
36     8
40     8
11     7
47     7
15     6
7      5
21     4
33     4
3      1
Name: age, dtype: int64

In [74]:
# Persons of age 17 has total of 19 devices, and so on.

## Number of devices for each Gender

In [75]:
data.Gender.value_counts()

M                 287
F                 164
                   49
Name: Gender, dtype: int64

### phone_type classification based on each Gender

In [76]:
# Genderwise bivariate analysis

female = data[data.Gender == "F"]
male   = data[data.Gender == "M"]

In [77]:
# For females
female.device_type.value_counts()

iphone     86
android    78
Name: device_type, dtype: int64

In [78]:
# For males
male.device_type.value_counts()

android    156
iphone     131
Name: device_type, dtype: int64

## Number of devices for each device_type

In [79]:
data.device_type.value_counts()

android    263
iphone     237
Name: device_type, dtype: int64

## Number of devices for each state

In [80]:
data.state.value_counts()

ME    52
DE    48
NH    48
CT    44
PA    43
NY    40
MD    40
VT    38
NJ    38
MA    37
DC    37
RI    35
Name: state, dtype: int64

## Age Binning

In [81]:
bins  = [0,18,24,34,44,54,64,120]
group = [1,2,3,4,5,6,7]

data['age_category'] = pd.cut(data['age'], bins, labels= group)

### Number of devices for each age_category

In [82]:
data.age_category.value_counts()

1    163
4    116
3    100
2     61
5     60
7      0
6      0
Name: age_category, dtype: int64

# SQL Solution

In [83]:
install_logs   = pd.read_csv('/Users/hduser/Desktop/install_logs.csv')
fraud_installs = pd.read_csv('/Users/hduser/Desktop/fraud_installs.csv')

In [84]:
install_logs

                             install_id install_date device_type     network
0  f21d0a65-25fb-4902-ae52-3bcc94946d94   03/06/2020     android  Appreciate
1  4311275f-34d2-43ef-8749-fd12fb9a5aac   26/07/2016         ios  Appreciate
2  c40ec682-eaff-4232-b200-f5d90caf4544   19/07/2020      google  Appreciate
3  4573ef6d-6333-4d36-8bd9-4ecbc87e4f1c   15/06/2019      iphone      InMobi
4  a6cd3609-64e5-4580-b016-b86395b436a4   04/08/2019     android     Altrooz
5  6bd945b3-7057-422b-b439-70e6dbbbf138   11/08/2020      iphone     Altrooz
6  92742d84-13d2-4bef-ba9e-40ef4ca647de   01/06/2019         ios      InMobi
7  7eb6fdef-2254-40d3-a16d-9fc40003e82e   25/06/2019     android      InMobi
8  7c085c5f-58da-46d2-a0be-2003393a0d30   25/08/2020     android     Altrooz
9  8a6b1204-e20a-48fa-802b-d724d270fbf6   17/06/2016         ios     Altrooz

In [85]:
install_logs.device_type[install_logs.device_type == 'iphone'] = 'ios'
install_logs.install_date = pd.to_datetime(install_logs.install_date)
install_logs

                             install_id install_date device_type     network
0  f21d0a65-25fb-4902-ae52-3bcc94946d94   2020-03-06     android  Appreciate
1  4311275f-34d2-43ef-8749-fd12fb9a5aac   2016-07-26         ios  Appreciate
2  c40ec682-eaff-4232-b200-f5d90caf4544   2020-07-19      google  Appreciate
3  4573ef6d-6333-4d36-8bd9-4ecbc87e4f1c   2019-06-15         ios      InMobi
4  a6cd3609-64e5-4580-b016-b86395b436a4   2019-04-08     android     Altrooz
5  6bd945b3-7057-422b-b439-70e6dbbbf138   2020-11-08         ios     Altrooz
6  92742d84-13d2-4bef-ba9e-40ef4ca647de   2019-01-06         ios      InMobi
7  7eb6fdef-2254-40d3-a16d-9fc40003e82e   2019-06-25     android      InMobi
8  7c085c5f-58da-46d2-a0be-2003393a0d30   2020-08-25     android     Altrooz
9  8a6b1204-e20a-48fa-802b-d724d270fbf6   2016-06-17         ios     Altrooz

In [86]:
fraud_installs

                                      id             fraud
0   f21d0a65-25fb-4902-ae52-3bcc94946d94          no-fraud
1   4311275f-34d2-43ef-8749-fd12fb9a5aac     Non Playstore
2   c40ec682-eaff-4232-b200-f5d90caf4544          no-fraud
3   4573ef6d-6333-4d36-8bd9-4ecbc87e4f1c    Blacklisted IP
4   a6cd3609-64e5-4580-b016-b86395b436a4       Fake Device
5   6bd945b3-7057-422b-b439-70e6dbbbf138      Duplicate IP
6   92742d84-13d2-4bef-ba9e-40ef4ca647de    Duplicate User
7   7eb6fdef-2254-40d3-a16d-9fc40003e82e  Incorrect Region
8   7c085c5f-58da-46d2-a0be-2003393a0d30       Fake Device
9   8a6b1204-e20a-48fa-802b-d724d270fbf6  Incorrect Region
10  4573ef6d-6333-4d36-8bd9-4ecbc87e4f1c    Duplicate User
11  a6cd3609-64e5-4580-b016-b86395b436a4  Incorrect Region
12  6bd945b3-7057-422b-b439-70e6dbbbf138       Fake Device
13  c40ec682-eaff-4232-b200-f5d90caf4544     Non Playstore
14  6bd945b3-7057-422b-b439-70e6dbbbf138    Duplicate User

In [87]:
fraud_installs["fraud_code"] = 999
fraud_installs.fraud_code[fraud_installs.fraud == "no-fraud"]         = 0
fraud_installs.fraud_code[fraud_installs.fraud == "Non Playstore"]    = 1
fraud_installs.fraud_code[fraud_installs.fraud == "Blacklisted IP"]   = 2
fraud_installs.fraud_code[fraud_installs.fraud == "Fake Device"]      = 3
fraud_installs.fraud_code[fraud_installs.fraud == "Duplicate IP"]     = 4
fraud_installs.fraud_code[fraud_installs.fraud == "Duplicate User"]   = 5
fraud_installs.fraud_code[fraud_installs.fraud == "Incorrect Region"] = 6
fraud_installs.fraud_code[fraud_installs.fraud == "Fake Device"]      = 7
fraud_installs

                                      id             fraud  fraud_code
0   f21d0a65-25fb-4902-ae52-3bcc94946d94          no-fraud           0
1   4311275f-34d2-43ef-8749-fd12fb9a5aac     Non Playstore           1
2   c40ec682-eaff-4232-b200-f5d90caf4544          no-fraud           0
3   4573ef6d-6333-4d36-8bd9-4ecbc87e4f1c    Blacklisted IP           2
4   a6cd3609-64e5-4580-b016-b86395b436a4       Fake Device           7
5   6bd945b3-7057-422b-b439-70e6dbbbf138      Duplicate IP           4
6   92742d84-13d2-4bef-ba9e-40ef4ca647de    Duplicate User           5
7   7eb6fdef-2254-40d3-a16d-9fc40003e82e  Incorrect Region           6
8   7c085c5f-58da-46d2-a0be-2003393a0d30       Fake Device           7
9   8a6b1204-e20a-48fa-802b-d724d270fbf6  Incorrect Region           6
10  4573ef6d-6333-4d36-8bd9-4ecbc87e4f1c    Duplicate User           5
11  a6cd3609-64e5-4580-b016-b86395b436a4  Incorrect Region           6
12  6bd945b3-7057-422b-b439-70e6dbbbf138       Fake Device           7
13  c40ec682-eaff-4232-b200-f5d90caf4544     Non Playstore           1
14  6bd945b3-7057-422b-b439-70e6dbbbf138    Duplicate User           5

In [88]:
import mysql.connector
from pprint import pprint

In [89]:
db = mysql.connector.connect(host= "sql3.freemysqlhosting.net", user= "sql3374392", password= "wewzcvzBw2",
                            database= "sql3374392")
mycursor = db.cursor()

### Creating tables

In [90]:
cmd = '''
CREATE TABLE install_logs(
install_id VARCHAR(45) PRIMARY KEY, 
install_date DATE,
device_type VARCHAR(10),
network VARCHAR(15)
);
'''
mycursor.execute(cmd)

In [91]:
cmd = '''
CREATE TABLE fraud_installs(
id VARCHAR(45),
fraud VARCHAR(50),
fraud_code INT,
FOREIGN KEY (id) REFERENCES install_logs(install_id)
);
'''
mycursor.execute(cmd)

### Inserting values into install_logs table

In [92]:
cols = "`,`".join([str(i) for i in install_logs.columns.tolist()])
for i,row in install_logs.iterrows():
    cmd = "INSERT INTO `install_logs` (`" +cols + "`) VALUES (" + "%s,"*(len(row)-1) + "%s)"
    mycursor.execute(cmd, tuple(row))

    db.commit()

In [93]:
cmd = "SELECT * FROM `install_logs`"
mycursor.execute(cmd)

result = mycursor.fetchall()
for i in result:
    print(i)

('4311275f-34d2-43ef-8749-fd12fb9a5aac', datetime.date(2016, 7, 26), 'ios', 'Appreciate')
('4573ef6d-6333-4d36-8bd9-4ecbc87e4f1c', datetime.date(2019, 6, 15), 'ios', 'InMobi')
('6bd945b3-7057-422b-b439-70e6dbbbf138', datetime.date(2020, 11, 8), 'ios', 'Altrooz')
('7c085c5f-58da-46d2-a0be-2003393a0d30', datetime.date(2020, 8, 25), 'android', 'Altrooz')
('7eb6fdef-2254-40d3-a16d-9fc40003e82e', datetime.date(2019, 6, 25), 'android', 'InMobi')
('8a6b1204-e20a-48fa-802b-d724d270fbf6', datetime.date(2016, 6, 17), 'ios', 'Altrooz')
('92742d84-13d2-4bef-ba9e-40ef4ca647de', datetime.date(2019, 1, 6), 'ios', 'InMobi')
('a6cd3609-64e5-4580-b016-b86395b436a4', datetime.date(2019, 4, 8), 'android', 'Altrooz')
('c40ec682-eaff-4232-b200-f5d90caf4544', datetime.date(2020, 7, 19), 'google', 'Appreciate')
('f21d0a65-25fb-4902-ae52-3bcc94946d94', datetime.date(2020, 3, 6), 'android', 'Appreciate')

### Inserting values into fraud_installs table

In [94]:
cols = "`,`".join([str(i) for i in fraud_installs.columns.tolist()])
for i,row in fraud_installs.iterrows():
    cmd = "INSERT INTO `fraud_installs` (`" +cols + "`) VALUES (" + "%s,"*(len(row)-1) + "%s)"
    mycursor.execute(cmd, tuple(row))

    db.commit()

In [95]:
cmd = "SELECT * FROM `fraud_installs`"
mycursor.execute(cmd)

result = mycursor.fetchall()
for i in result:
    print(i)

('f21d0a65-25fb-4902-ae52-3bcc94946d94', 'no-fraud', 0)
('4311275f-34d2-43ef-8749-fd12fb9a5aac', 'Non Playstore', 1)
('c40ec682-eaff-4232-b200-f5d90caf4544', 'no-fraud', 0)
('4573ef6d-6333-4d36-8bd9-4ecbc87e4f1c', 'Blacklisted IP', 2)
('a6cd3609-64e5-4580-b016-b86395b436a4', 'Fake Device', 7)
('6bd945b3-7057-422b-b439-70e6dbbbf138', 'Duplicate IP', 4)
('92742d84-13d2-4bef-ba9e-40ef4ca647de', 'Duplicate User', 5)
('7eb6fdef-2254-40d3-a16d-9fc40003e82e', 'Incorrect Region', 6)
('7c085c5f-58da-46d2-a0be-2003393a0d30', 'Fake Device', 7)
('8a6b1204-e20a-48fa-802b-d724d270fbf6', 'Incorrect Region', 6)
('4573ef6d-6333-4d36-8bd9-4ecbc87e4f1c', 'Duplicate User', 5)
('a6cd3609-64e5-4580-b016-b86395b436a4', 'Incorrect Region', 6)
('6bd945b3-7057-422b-b439-70e6dbbbf138', 'Fake Device', 7)
('c40ec682-eaff-4232-b200-f5d90caf4544', 'Non Playstore', 1)
('6bd945b3-7057-422b-b439-70e6dbbbf138', 'Duplicate User', 5)

## Solutions

### total number of frauds occurred for each fraud category

For example: Output would be as below with three columns
Fraud           Fraud_code    Count
Non Playstore        1         203
Fake Device          3         300

In [96]:
cmd = '''
SELECT fraud, fraud_code, count(fraud) as count 
FROM install_logs JOIN fraud_installs
ON install_logs.install_id = fraud_installs.id
GROUP BY(fraud)
;
'''
mycursor.execute(cmd)

answer1 = mycursor.fetchall()
answer1 = pd.DataFrame(answer1, columns=['Fraud', 'Fraud_code', 'Count'])
answer1

              Fraud  Fraud_code  Count
0    Blacklisted IP           2      1
1      Duplicate IP           4      1
2    Duplicate User           5      3
3       Fake Device           7      3
4  Incorrect Region           6      3
5          no-fraud           0      2
6     Non Playstore           1      2

### non-fraud installs for each network

In [97]:
cmd = '''
SELECT network, count(fraud)
FROM install_logs JOIN fraud_installs
ON install_logs.install_id = fraud_installs.id
WHERE fraud = 'no-fraud'
GROUP BY(network)
;
'''
mycursor.execute(cmd)

answer2 = mycursor.fetchall()
answer2 = pd.DataFrame(answer2, columns=['Network', 'Count'])
answer2

      Network  Count
0  Appreciate      2

### top 3 frauds in year 2019

In [98]:
cmd = '''
SELECT install_id, install_date,device_type,fraud,fraud_code
FROM install_logs JOIN fraud_installs
ON install_logs.install_id = fraud_installs.id
WHERE YEAR(install_date) = 2019
ORDER BY fraud_code DESC
LIMIT 3
;
'''
mycursor.execute(cmd)

answer3 = mycursor.fetchall()
answer3 = pd.DataFrame(answer3, columns=['Install_ID', 'Install_Date', 'Phone_Type',
                                        'Fraud', 'Fraud_Code'])
answer3

,Install_ID,Install_Date,Phone_Type,Fraud,Fraud_Code
0,a6cd3609-64e5-4580-b016-b86395b436a4,2019-04-08,android,Fake Device,7
1,7eb6fdef-2254-40d3-a16d-9fc40003e82e,2019-06-25,android,Incorrect Region,6
2,a6cd3609-64e5-4580-b016-b86395b436a4,2019-04-08,android,Incorrect Region,6

### least 3 frauds in year 2019

In [99]:
cmd = '''
SELECT install_id, install_date,device_type,fraud,fraud_code
FROM install_logs JOIN fraud_installs
ON install_logs.install_id = fraud_installs.id
WHERE YEAR(install_date) = 2019
ORDER BY fraud_code
LIMIT 3
;
'''
mycursor.execute(cmd)

answer4 = mycursor.fetchall()
answer4 = pd.DataFrame(answer4, columns=['Install_ID', 'Install_Date', 'Phone_Type',
                                        'Fraud', 'Fraud_Code'])
answer4

,Install_ID,Install_Date,Phone_Type,Fraud,Fraud_Code
0,4573ef6d-6333-4d36-8bd9-4ecbc87e4f1c,2019-06-15,ios,Blacklisted IP,2
1,4573ef6d-6333-4d36-8bd9-4ecbc87e4f1c,2019-06-15,ios,Duplicate User,5
2,92742d84-13d2-4bef-ba9e-40ef4ca647de,2019-01-06,ios,Duplicate User,5

### total installs

In [100]:
cmd = '''
SELECT COUNT(id) 
FROM fraud_installs;'''
mycursor.execute(cmd)

total_installs = mycursor.fetchall()
total_installs = total_installs[0][0]
total_installs

15

### total non-fraud installs

In [101]:
cmd = '''
SELECT COUNT(id)
FROM fraud_installs
WHERE fraud = 'no-fraud'
;
'''
mycursor.execute(cmd)

valid_installs = mycursor.fetchall()
valid_installs = valid_installs[0][0]
valid_installs

2

### total fraud installs

In [102]:
cmd = '''
SELECT COUNT(id)
FROM fraud_installs
WHERE fraud != 'no-fraud'
;
'''
mycursor.execute(cmd)

fraud_installs_ = mycursor.fetchall()
fraud_installs_ = fraud_installs_[0][0]
fraud_installs_

13

### fraud code count

In [103]:
# Answer verification
fraud_installs.fraud_code.value_counts()

7    3
6    3
5    3
1    2
0    2
4    1
2    1
Name: fraud_code, dtype: int64

In [104]:
def fraud_code_count(num):
    cmd = '''select count(id) from fraud_installs where fraud_code = {};'''.format(num)
    mycursor.execute(cmd)
    ans = mycursor.fetchall()
    ans = ans[0][0]
    return ans

In [105]:
fraud_code_0_count = fraud_code_count(0)
fraud_code_1_count = fraud_code_count(1)
fraud_code_2_count = fraud_code_count(2)
fraud_code_3_count = fraud_code_count(3)
fraud_code_4_count = fraud_code_count(4)
fraud_code_5_count = fraud_code_count(5)
fraud_code_6_count = fraud_code_count(6)
fraud_code_7_count = fraud_code_count(7)

print("fraud_code_0_count is ", fraud_code_0_count)
print("fraud_code_1_count is ", fraud_code_1_count)
print("fraud_code_2_count is ", fraud_code_2_count)
print("fraud_code_3_count is ", fraud_code_3_count)
print("fraud_code_4_count is ", fraud_code_4_count)
print("fraud_code_5_count is ", fraud_code_5_count)
print("fraud_code_6_count is ", fraud_code_6_count)
print("fraud_code_7_count is ", fraud_code_7_count)

fraud_code_0_count is  2
fraud_code_1_count is  2
fraud_code_2_count is  1
fraud_code_3_count is  0
fraud_code_4_count is  1
fraud_code_5_count is  3
fraud_code_6_count is  3
fraud_code_7_count is  3

### compiled last answers

In [106]:
answers = {
    'Description': ['total_installs', 'valid_installs', 'fraud_installs', 'fraud_code_0_count',
                   'fraud_code_1_count', 'fraud_code_2_count', 'fraud_code_3_count',
                   'fraud_code_4_count', 'fraud_code_5_count', 'fraud_code_6_count',
                   'fraud_code_7_count'],
    'Value'      : [ total_installs, valid_installs, fraud_installs_, fraud_code_0_count,
                   fraud_code_1_count, fraud_code_2_count, fraud_code_3_count, fraud_code_4_count,
                   fraud_code_5_count, fraud_code_6_count, fraud_code_7_count]
}

answers = pd.DataFrame(answers)
answers

           Description  Value
0       total_installs     15
1       valid_installs      2
2       fraud_installs     13
3   fraud_code_0_count      2
4   fraud_code_1_count      2
5   fraud_code_2_count      1
6   fraud_code_3_count      0
7   fraud_code_4_count      1
8   fraud_code_5_count      3
9   fraud_code_6_count      3
10  fraud_code_7_count      3

 ## Output File

In [107]:
answer1.to_csv('final_report_output(1).csv')
answer2.to_csv('final_report_output(2).csv')
answer3.to_csv('final_report_output(3).csv')
answer4.to_csv('final_report_output(4).csv')
answers.to_csv('final_report_output(5).csv')